; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 480819 2 2 2 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	infrared1 - mode
	Star2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(have_image Planet3 infrared1)
	(have_image Phenomenon4 image0)
	(have_image Star5 image0)
	(have_image Planet6 image0)
	(have_image Phenomenon7 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
4. (turn_to satellite1 planet3 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet3)
   goals met: 0 of 5
5. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 5
6. (turn_to satellite1 phenomenon7 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 5
7. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   goals met: 0 of 5
8. (turn_to satellite1 phenomenon4 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon4)
   goals met: 0 of 5
9. (take_image satellite0 planet6 instrument1 image0)
   added: (have_image planet6 image0)
   goals met: 1 of 5
10. (turn_to satellite1 phenomenon7 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 5
11. (turn_to satellite0 planet3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet3)
   goals met: 1 of 5
12. (turn_to satellite1 phenomenon4 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon4)
   goals met: 1 of 5
13. (take_image satellite0 planet3 instrument1 infrared1)
   added: (have_image planet3 infrared1)
   goals met: 2 of 5
14. (turn_to satellite1 star5 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star5)
   goals met: 2 of 5
15. (turn_to satellite0 phenomenon7 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 5
16. (turn_to satellite1 phenomenon4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon4)
   goals met: 2 of 5
17. (take_image satellite0 phenomenon7 instrument1 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 3 of 5
18. (turn_to satellite1 groundstation0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 groundstation0)
   goals met: 3 of 5
19. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   goals met: 3 of 5
20. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 3 of 5
21. (take_image satellite0 star5 instrument1 image0)
   added: (have_image star5 image0)
   goals met: 4 of 5
22. (turn_to satellite1 phenomenon4 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon4)
   goals met: 4 of 5
23. (take_image satellite1 phenomenon4 instrument2 image0)
   added: (have_image phenomenon4 image0)
   goals met: 5 of 5
